---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeBackDirn2
source: html/c7946097-4cbf-d945-f453-66e00027440e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeBackDirn2 Property

"Interior Minor Hook Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookTypeBackDirn2 { get; }
```